package ru.kudesnik.infograce

data class Item(
    val id: Int,
    val name: String,
    var position: Int,
    var isCheckedSwitch:Boolean,
    var sliderValue: Int
) {
//    fun getItems(): List<Item> {
//        return listOf<Item>(
//            Item(0, "Слой делян", 0),
//            Item(1, "Сигналы о лесоизменениях, тестовая выборка с ув-ным шагом", 1),
//            Item(2, "Преграды для прохождения огня", 2),
//            Item(3, "Маска облачности от 02.07.2021", 3),
//            Item(4, "Маска облачности от 02.07.2021", 4),
//            Item(5, "Папка со слоями", 5),
//            Item(6, "Сигналы о лесоизменениях, тестовая выборка с ув-ным шагом", 6),
//            Item(7, "Преграды для прохождения огня", 7),
//            Item(8, "Контуры гарей", 8),
//            Item(9, "Маска облачности от 02.07.2021", 9),
//            Item(10, "Маска облачности от 02.07.2021", 10),
//            Item(11, "Маска облачности от 02.07.2021", 1),
//            Item(12, "Маска облачности от 02.07.2021", 12),
//        )
//    }
}
